<?php

namespace App\Helpers;

class HouseHelper
{
    /**
     * Массив муниципальных округов и регионов для формирования на странице "Узнайте о своем доме"
     *
     * @return array
     */
    public static function getMunicipalities()
    {
        $arrMunicipalities['40770740560360901016031'] = array('Id' => '36', 'Name' => 'Рязань', 'Type' => 'G');
        $arrMunicipalities['40770740490102101101501703'] = array('Id' => '28', 'Name' => 'Касимов', 'Type' => 'G');
        $arrMunicipalities['40770740570102101703017'] = array('Id' => '37', 'Name' => 'Сасово', 'Type' => 'G');
        $arrMunicipalities['4077074057013017018011016'] = array('Id' => '38', 'Name' => 'Скопин', 'Type' => 'G');

        $arrMunicipalities['56036090101602101301101207401901012017016'] = array('Id' => '16', 'Name' => 'Рязанский', 'Type' => 'R');
        $arrMunicipalities['37014060130210101605019017079053060302101301101207401901012017016'] = array('Id' => '2', 'Name' => 'Александро-Невский', 'Type' => 'R');
        $arrMunicipalities['4301901501102801101602101301101207401901012017016'] = array('Id' => '3', 'Name' => 'Ермишинский', 'Type' => 'R');
        $arrMunicipalities['4601025010190170302101301101207401901012017016'] = array('Id' => '4', 'Name' => 'Захаровский', 'Type' => 'R');
        $arrMunicipalities['49010501701502101301101207401901012017016'] = array('Id' => '5', 'Name' => 'Кадомский', 'Type' => 'R');
        $arrMunicipalities['49010210110150170302101301101207401901012017016'] = array('Id' => '6', 'Name' => 'Касимовский', 'Type' => 'R');
        $arrMunicipalities['49014060180110130170302101301101207401901012017016'] = array('Id' => '7', 'Name' => 'Клепиковский', 'Type' => 'R');
        $arrMunicipalities['49017019010201401101602101301101207401901012017016'] = array('Id' => '8', 'Name' => 'Кораблинский', 'Type' => 'R');
        $arrMunicipalities['52011014017021014010302101301101207401901012017016'] = array('Id' => '9', 'Name' => 'Милославский', 'Type' => 'R');
        $arrMunicipalities['52011025010120140170302101301101207401901012017016'] = array('Id' => '10', 'Name' => 'Михайловский', 'Type' => 'R');
        $arrMunicipalities['550110220601401101602101301101207401901012017016'] = array('Id' => '11', 'Name' => 'Пителинский', 'Type' => 'R');
        $arrMunicipalities['5501901701602101301101207401901012017016'] = array('Id' => '12', 'Name' => 'Пронский', 'Type' => 'R');
        $arrMunicipalities['5502302203602201101602101301101207401901012017016'] = array('Id' => '13', 'Name' => 'Путятинский', 'Type' => 'R');
        $arrMunicipalities['56032020160170302101301101207401901012017016'] = array('Id' => '14', 'Name' => 'Рыбновский', 'Type' => 'R');
        $arrMunicipalities['560360802101301101207401901012017016'] = array('Id' => '15', 'Name' => 'Ряжский', 'Type' => 'R');
        $arrMunicipalities['5701018017080130170302101301101207401901012017016'] = array('Id' => '16', 'Name' => 'Сапожковский', 'Type' => 'R');
        $arrMunicipalities['570101901060302101301101207401901012017016'] = array('Id' => '17', 'Name' => 'Сараевский', 'Type' => 'R');
        $arrMunicipalities['57010210170302101301101207401901012017016'] = array('Id' => '18', 'Name' => 'Сасовский', 'Type' => 'R');
        $arrMunicipalities['5701301701801101602101301101207401901012017016'] = array('Id' => '19', 'Name' => 'Скопинский', 'Type' => 'R');
        $arrMunicipalities['570180102102101301101207401901012017016'] = array('Id' => '20', 'Name' => 'Спасский', 'Type' => 'R');
        $arrMunicipalities['5702201019017080110140170302101301101207401901012017016'] = array('Id' => '21', 'Name' => 'Старожиловский', 'Type' => 'R');
        $arrMunicipalities['590250170140170302101301101207401901012017016'] = array('Id' => '22', 'Name' => 'Ухоловский', 'Type' => 'R');
        $arrMunicipalities['640230270130170302101301101207401901012017016'] = array('Id' => '23', 'Name' => 'Чучковский', 'Type' => 'R');
        $arrMunicipalities['650102601301101207401901012017016'] = array('Id' => '24', 'Name' => 'Шацкий', 'Type' => 'R');
        $arrMunicipalities['650110140170302101301101207401901012017016'] = array('Id' => '25', 'Name' => 'Шиловский', 'Type' => 'R');

        return $arrMunicipalities;
    }
}
